УправлениеПаркомАттракционов/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПосещениеАттракциона</name>
  </enumValues>
</mdclass:Enum>

УправлениеПаркомАттракционов/src/Catalogs/Номенклатура/Forms/ItemForm/Module.bsl
#Region Variables

#EndRegion

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	УправлениеВидимостьюЭлементовФормы();	 
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure ВидНоменклатурыOnChange(Item)
	УправлениеВидимостьюЭлементовФормы();
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlers //<FromTableName>

// Enter code here.

#EndRegion

#Region FormCommandsEventHandlers

// Enter code here.

#EndRegion

#Region Private

&AtServer 
Procedure УправлениеВидимостьюЭлементовФормы()
	
	ЭтоПосещениеАттракциона = (Object.ВидНоменклатуры = Enums.ВидыНоменклатуры.ПосещениеАттракциона);
	
	Элементы.ВидАттракциона.Visible = ЭтоПосещениеАттракциона;
	Элементы.КоличествоПосещений.Visible = ЭтоПосещениеАттракциона;
	
EndProcedure

#EndRegion
